In [24]:
# Run Script to Update Corona.csv
%run ScriptToUpdateCsv.py

In [25]:
data.to_csv('Corona.csv')

In [26]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt
import seaborn as sns

In [27]:
df = pd.read_csv("Corona.csv",index_col='Sr.No')

In [14]:
df.head()

       Unnamed: 0                    States/UT  Confirmed  Recovered  Deceased
Sr.No
1               0               Andhra Pradesh        473         14         9
2               1  Andaman and Nicobar Islands         11         10         0
3               2            Arunachal Pradesh          1          0         0
4               3                        Assam         31          0         1
5               4                        Bihar         66         26         1

In [15]:
df.head()

       Unnamed: 0                    States/UT  Confirmed  Recovered  Deceased
Sr.No
1               0               Andhra Pradesh        473         14         9
2               1  Andaman and Nicobar Islands         11         10         0
3               2            Arunachal Pradesh          1          0         0
4               3                        Assam         31          0         1
5               4                        Bihar         66         26         1

In [16]:
df=df.drop(['Unnamed: 0'],axis=1)
df.head()

                         States/UT  Confirmed  Recovered  Deceased
Sr.No
1                   Andhra Pradesh        473         14         9
2      Andaman and Nicobar Islands         11         10         0
3                Arunachal Pradesh          1          0         0
4                            Assam         31          0         1
5                            Bihar         66         26         1

<h2 style="color:Blue">Confirmed Case Status</h2>

In [17]:
df_max = df.groupby(['States/UT']).max().sort_values(by='Confirmed',ascending=False)
df_max.head(5)

                Confirmed  Recovered  Deceased
States/UT
Maharashtra          2337        229       160
Delhi                1510         30        28
Tamil Nadu           1173         58        11
Rajasthan             879        133         3
Madhya Pradesh        730         51        50

<h2 style="color:red">Deceased Status</h2>

In [18]:
df_max = df.groupby(['States/UT']).max().sort_values(by='Deceased',ascending=False)
df_max.head(5)

                Confirmed  Recovered  Deceased
States/UT
Maharashtra          2337        229       160
Madhya Pradesh        730         51        50
Delhi                1510         30        28
Gujarat               617         55        26
Telengana             624        100        17

<h2 style="color:green">Recovering Status</h2>

In [19]:
df_max = df.groupby(['States/UT']).max().sort_values(by='Recovered',ascending=False)
df_max.head(5)

             Confirmed  Recovered  Deceased
States/UT
Maharashtra       2337        229       160
Kerala             379        198         3
Rajasthan          879        133         3
Telengana          624        100        17
Karnataka          258         65         9

<h2 style="color:darkgreen" >These States/UT Have No Death Due to Covid-19 Yet</h2>

In [20]:
df.loc[df['Deceased']==0,['States/UT','Deceased']]

                         States/UT  Deceased
Sr.No
2      Andaman and Nicobar Islands         0
3                Arunachal Pradesh         0
6                       Chandigarh         0
7                     Chhattisgarh         0
9                              Goa         0
17                          Ladakh         0
20                         Manipur         0
21                       Meghalaya         0
22                         Mizoram         0
23                        Nagaland         0
25                      Puducherry         0
30                         Tripura         0
31                     Uttarakhand         0

<h2 style="color:red" >These States/Ut has Confirm Case over 500</h2>

In [21]:
df.loc[df['Confirmed']>500,['States/UT','Confirmed']]

            States/UT  Confirmed
Sr.No
8               Delhi       1510
10            Gujarat        617
18     Madhya Pradesh        730
19        Maharashtra       2337
27          Rajasthan        879
28         Tamil Nadu       1173
29          Telengana        624
32      Uttar Pradesh        657

<h2 style="color:green" > Conclusion After Analysis</h2>
<br>
<div style="color:blue">
    <ul>    
        <li> Maharashtra ,Delhi and TamilNadu has maximum confirmed cases.</li>
        <li> Maharashtra Madhya Pradesh and Delhi has maximum deceased cases.</li>
        <li> Maharashtra, Kerla and Telengana has maximum recovered. </li>
    </ul>
</div>